УТ_для_edt/src/Documents/смартASP_БонусыЗаЗнания/смартASP_БонусыЗаЗнания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>смартASP_БонусыЗаЗнания</name>
  <comment>//доработка внешней компании Асиситпро по проекту Бонусы инженеров</comment>
  <registerRecords>AccumulationRegister.смартASP_НакоплениеБонусов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартСтатусРасчетаБонусов</name>
    <comment>#1288 Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров</comment>
    <type>
      <types>EnumRef.смартСтатусыДокументовРасчетаБонусов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>БонусыЗнаний</name>
    <attributes>
      <name>Инженер</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Бонус</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/InformationRegisters/смартASP_ТаблицаЗнаний/смартASP_ТаблицаЗнаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартASP_ТаблицаЗнаний</name>
  <comment>//доработка внешней компании Асиситпро по проекту Бонусы инженеров</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Балл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Инженер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Категория</name>
    <type>
      <types>CatalogRef.смартASP_Категории</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Enums/смартСтатусыДокументовРасчетаБонусов/смартСтатусыДокументовРасчетаБонусов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартСтатусыДокументовРасчетаБонусов</name>
  <comment>#1288 Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров</comment>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>РасчетЗавершен</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Documents/смартASP_БонусыЗаЗнания/Forms/ФормаДокумента/Module.bsl
//доработка внешней компании Асиситпро по проекту Бонусы инженеров
&НаСервере
Процедура ЗаполнитьНаСервере()
	Объект.БонусыЗнаний.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	смартASP_ТаблицаЗнаний.Инженер КАК Инженер,
		|	смартASP_ТаблицаЗнаний.Категория КАК Категория,
		|	смартASP_ТаблицаЗнаний.Балл КАК Балл,
		|	ЕСТЬNULL(смартASP_Категории.Коэффициент, 0) КАК Коэф,
		|	смартASP_ТаблицаЗнаний.Балл * ЕСТЬNULL(смартASP_Категории.Коэффициент, 0) КАК Сумма
		|ПОМЕСТИТЬ вр
		|ИЗ
		|	(ВЫБРАТЬ
		|		ASP_ТаблицаЗнанийСрезПоследних.Инженер КАК Инженер,
		|		ASP_ТаблицаЗнанийСрезПоследних.Категория КАК Категория,
		|		ASP_ТаблицаЗнанийСрезПоследних.Балл КАК Балл
		|	ИЗ
		|		РегистрСведений.смартASP_ТаблицаЗнаний.СрезПоследних(&Период, ) КАК ASP_ТаблицаЗнанийСрезПоследних) КАК смартASP_ТаблицаЗнаний
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.смартASP_Категории КАК смартASP_Категории
		|		ПО смартASP_ТаблицаЗнаний.Категория = смартASP_Категории.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вр.Инженер КАК Инженер,
		|	СУММА(вр.Сумма) КАК Бонус
		|ИЗ
		|	вр КАК вр
		|
		|СГРУППИРОВАТЬ ПО
		|	вр.Инженер
		|
		|УПОРЯДОЧИТЬ ПО
		|	Инженер";
	
	Запрос.УстановитьПараметр("Период", КонецМесяца(Объект.Дата));
	
	тз = Запрос.Выполнить().Выгрузить();
	
	К = Константы.смартASP_КоэффициентДляРасчетаБонусовЗаЗнания.Получить();
	Если К = 0 Тогда
		К = 1
	КонецЕсли;
	
	Для Каждого стр Из тз Цикл
		стр.Бонус = стр.Бонус * К;
		ЗаполнитьЗначенияСвойств(Объект.БонусыЗнаний.Добавить(), стр)
	КонецЦикла;

	//++#1288 смарт: Лопато 29.12.2022 //Дополннение в блоке расчета бонусов инженеров
	Модифицированность = Истина;
	//--#1288 смарт: Лопато 29.12.2022
	
КонецПроцедуры

//доработка внешней компании Асиситпро по проекту Бонусы инженеров
&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

//доработка внешней компании Асиситпро по проекту Бонусы инженеров
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Дата = ТекущаяДата();
		Объект.Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров  
	Если НЕ ЗначениеЗаполнено(Объект.смартСтатусРасчетаБонусов) Тогда
		Объект.смартСтатусРасчетаБонусов = Перечисления.смартСтатусыДокументовРасчетаБонусов.ВРаботе;
	КонецЕсли;	
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды	

	УстановитьДоступностьПоСтатусуРасчета();
	//--#1288 смарт: Лопато 26.12.2022
	
КонецПроцедуры

//доработка внешней компании Асиситпро по проекту Бонусы инженеров
&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Объект.Номер = ""
КонецПроцедуры

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаСервере
Процедура УстановитьДоступностьПоСтатусуРасчета()

	смартASP_ОбщийМодуль.смартУстановитьТолькоПросмотрФормыРасчетЗавершен(ЭтаФорма);
	
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьДоступностьПоСтатусуРасчета();

КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаКлиенте
Процедура ПриОткрытии(Отказ)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

#Область ПодключаемыеКоманды

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

#КонецОбласти

#Область ОбработчикиКомандФормы

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Записать(ЭтаФорма);
	
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаКлиенте
Процедура ПровестиДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма);
	
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	
	ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтаФорма);
	
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

#КонецОбласти
